Конфигурация/Documents/СведенияПредоставляемыеЮрФизЛицами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СведенияПредоставляемыеЮрФизЛицами</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСведений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиСведенийПредоставляемыхЮрФизЛицами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьДляПН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыИнвестирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Рынок</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЦеннойБумаги</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эмитент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныйОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приход</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расход</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечныйОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сделки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСделки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСделки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рынок</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЦеннойБумаги</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эмитент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНКД</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НКД</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокРЕПО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаРЕПО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СделкиСВалютой</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСделки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСделки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрвалюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКонтрвалюты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/СведенияПредоставляемыеЮрФизЛицами/Forms/ФормаОшибкиИмпорта/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресТаблицыОшибок") Тогда
		ЭтаФорма.АдресТаблицыОшибок = Параметры.АдресТаблицыОшибок;
		Структура = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресТаблицыОшибок);
		
		ЕстьОшибки = Структура.ТаблицаОшибок.Количество() > 0;
		ЕстьСообщения = Структура.СообщенияПользователю.Количество() > 0;
		
		Элементы.Ошибки.Видимость = ЕстьОшибки;
		Элементы.ОшибкиКомандаИмпортироватьОбъектыИзМатрикс.Видимость = ЕстьОшибки;
		Элементы.Сообщения.Видимость = ЕстьСообщения;
		
		Если ЕстьОшибки Тогда
		
			ЭтаФорма.Ошибки.Загрузить(Структура.ТаблицаОшибок);
		
		КонецЕсли; 
		
		Если ЕстьСообщения Тогда
		
			Для каждого Сообщение Из Структура.СообщенияПользователю Цикл
				НоваяСтрока = ЭтаФорма.Сообщения.Добавить();
				НоваяСтрока.Информация = Сообщение.Текст;
			КонецЦикла; 
		
		КонецЕсли; 

	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИмпортироватьОбъектыИзМатрикс(Команда)
	
	ТекСтрока = Элементы.Ошибки.ТекущиеДанные;
	ГруппаОбъектов = ПредопределенноеЗначение("Справочник.ГруппыИмпортируемыхОбъектов.Облигации");
	СтрокаПоиска = "";
	
	Если ТекСтрока <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(ТекСтрока.Рынок) Тогда
			ГруппаОбъектов = ОпределитьГруппуОбъектовПоРынку(ТекСтрока.Рынок);
		КонецЕсли; 
		
		СтрокаПоиска = ТекСтрока.ИдентификаторЦеннойБумаги;
		
	КонецЕсли;
	
	Если ГруппаОбъектов = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Импорт объектов из Matrix для рынка '" + ТекСтрока.Рынок + "' не поддерживается.");
		Возврат;
	КонецЕсли; 
	
	ПараметрыИмпорта = Новый Структура;
	ПараметрыИмпорта.Вставить("ГруппаПравил",                      "Матрих");
	ПараметрыИмпорта.Вставить("ГруппаОбъектов",                    ГруппаОбъектов);
	ПараметрыИмпорта.Вставить("ЗакрытьФормуПослеУспешногоИмпорта", Истина);
	
	Форма = ПолучитьФорму("Обработка.ИмпортНормативноСправочнойИнформации.Форма", ПараметрыИмпорта);
	Форма.СтрокаПоиска = СтрокаПоиска;
	ОбработанныеОбъекты = Форма.ОткрытьМодально();
	
	Если ТекСтрока <> Неопределено И ТипЗнч(ОбработанныеОбъекты) = Тип("Массив") И ОбработанныеОбъекты.Количество() > 0 Тогда
		ТекСтрока.ЦеннаяБумага = ОбработанныеОбъекты[0];
		ТекСтрока.Рынок = РаботаСЦеннымиБумагамиКлиентСервер.РынокПоЦеннойБумаге(ТекСтрока.ЦеннаяБумага);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьГруппуОбъектовПоРынку(Рынок)

	Если Рынок = Перечисления.РынкиЦенныхБумаг.Акции Тогда
		ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.Акции;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.ВалютныеПары Тогда
		ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ВалютныеПары;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Векселя Тогда
		ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.Векселя;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.ДепозитарныеРасписки Тогда
		ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ДепозитарныеРасписки;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия Тогда
		ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ИпотечныеСертификатыУчастия;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
		ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.Облигации;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Паи Тогда
		ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.Паи;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Фьючерсы
			Или Рынок = Перечисления.РынкиЦенныхБумаг.Опционы 
			Или Рынок = Перечисления.РынкиЦенныхБумаг.ДрагоценныеМеталлы Тогда
			
		ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ПроизводныеФинансовыеИнструменты;
		
	Иначе
		ГруппаОбъектов = Неопределено;
	КонецЕсли;
	
	Возврат ГруппаОбъектов;

КонецФункции

&НаСервере
Процедура ПриЗакрытииНаСервере()
	ПоместитьВоВременноеХранилище(ЭтаФорма.Ошибки.Выгрузить(), ЭтаФорма.АдресТаблицыОшибок);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ПриЗакрытииНаСервере();
КонецПроцедуры
